cmsis-svd/cmsis-svd/data/Spansion/MB9BF50xN_svd.xml
        <!-- REGISTER "IRQ15MON" -->
        <register>
          <name>IRQ15MON</name>
          <description>IRQ15 Batch Read Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt request on MFS ch.4</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ16MON" -->
        <register>
          <name>IRQ16MON</name>
          <description>IRQ16 Batch Read Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request on MFS ch.4</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request on MFS ch.4</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ17MON" -->
        <register>
          <name>IRQ17MON</name>
          <description>IRQ17 Batch Read Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt request on MFS ch.5</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ18MON" -->
        <register>
          <name>IRQ18MON</name>
          <description>IRQ18 Batch Read Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request on MFS ch.5</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request on MFS ch.5</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ19MON" -->
        <register>
          <name>IRQ19MON</name>
          <description>IRQ19 Batch Read Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt request on MFS ch.6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ20MON" -->
        <register>
          <name>IRQ20MON</name>
          <description>IRQ20 Batch Read Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request on MFS ch.6</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request on MFS ch.6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ21MON" -->
        <register>
          <name>IRQ21MON</name>
          <description>IRQ21 Batch Read Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT" -->
            <field>
              <name>MFSINT</name>
              <description>Reception interrupt request on MFS ch.7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ22MON" -->
        <register>
          <name>IRQ22MON</name>
          <description>IRQ22 Batch Read Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request on MFS ch.7</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request on MFS ch.7</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ23MON" -->
        <register>
          <name>IRQ23MON</name>
          <description>IRQ23 Batch Read Register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPGINT5" -->
            <field>
              <name>PPGINT5</name>
              <description>Interrupt request on PPG ch.12</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PPGINT4" -->
            <field>
              <name>PPGINT4</name>
              <description>Interrupt request on PPG ch.10</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PPGINT3" -->
            <field>
              <name>PPGINT3</name>
              <description>Interrupt request on PPG ch.8</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PPGINT2" -->
            <field>
              <name>PPGINT2</name>
              <description>Interrupt request on PPG ch.4 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PPGINT1" -->
            <field>
              <name>PPGINT1</name>
              <description>Interrupt request on PPG ch.2 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PPGINT0" -->
            <field>
              <name>PPGINT0</name>
              <description>Interrupt request on PPG ch.0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
