cmsis-svd/cmsis-svd/data/Spansion/MB9BF50xN_svd.xml
        <!-- REGISTER "IF1DTB2_B" -->
        <register>
          <name>IF1DTB2_B</name>
          <description>IF1 Data Registers B2</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_6_" -->
            <field>
              <name>DATA_6_</name>
              <description>Data(6)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_7_" -->
            <field>
              <name>DATA_7_</name>
              <description>Data(7)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF1DTB1_B" -->
        <register>
          <name>IF1DTB1_B</name>
          <description>IF1 Data Registers B1</description>
          <addressOffset>0x36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA_4_" -->
            <field>
              <name>DATA_4_</name>
              <description>Data(4)</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA_5_" -->
            <field>
              <name>DATA_5_</name>
              <description>Data(5)</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2CREQ" -->
        <register>
          <name>IF2CREQ</name>
          <description>IF2 Command Request Register</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x80FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy flag bit </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MESSAGENUMBER" -->
            <field>
              <name>MESSAGENUMBER</name>
              <description>Message number</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2CMSK" -->
        <register>
          <name>IF2CMSK</name>
          <description>IF2 Command Mask Register</description>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WRRD" -->
            <field>
              <name>WRRD</name>
              <description>Writing or reading control bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>Mask data update bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ARB" -->
            <field>
              <name>ARB</name>
              <description>Arbitration data update bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONTROL" -->
            <field>
              <name>CONTROL</name>
              <description>Control data update bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIP" -->
            <field>
              <name>CIP</name>
              <description>Interrupt clear bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NEWDAT" -->
            <field>
              <name>NEWDAT</name>
              <description>Message transmission request bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAA" -->
            <field>
              <name>DATAA</name>
              <description>Data 0-3 update bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATAB" -->
            <field>
              <name>DATAB</name>
              <description>Data 4-7 update bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2MSK1" -->
        <register>
          <name>IF2MSK1</name>
          <description>IF2 Mask Registers 1</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSK15" -->
            <field>
              <name>MSK15</name>
              <description>Msk15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK14" -->
            <field>
              <name>MSK14</name>
              <description>Msk14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK13" -->
            <field>
              <name>MSK13</name>
              <description>Msk13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK12" -->
            <field>
              <name>MSK12</name>
              <description>Msk12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK11" -->
            <field>
              <name>MSK11</name>
              <description>Msk11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK10" -->
            <field>
              <name>MSK10</name>
              <description>Msk10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK9" -->
            <field>
              <name>MSK9</name>
              <description>Msk9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK8" -->
            <field>
              <name>MSK8</name>
              <description>Msk8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK7" -->
            <field>
              <name>MSK7</name>
              <description>Msk7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK6" -->
            <field>
              <name>MSK6</name>
              <description>Msk6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK5" -->
            <field>
              <name>MSK5</name>
              <description>Msk5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK4" -->
            <field>
              <name>MSK4</name>
              <description>Msk4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK3" -->
            <field>
              <name>MSK3</name>
              <description>Msk3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK2" -->
            <field>
              <name>MSK2</name>
              <description>Msk2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK1" -->
            <field>
              <name>MSK1</name>
              <description>Msk1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK0" -->
            <field>
              <name>MSK0</name>
              <description>Msk0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2MSK2" -->
        <register>
          <name>IF2MSK2</name>
          <description>IF2 Mask Registers 2</description>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xDFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MXTD" -->
            <field>
              <name>MXTD</name>
              <description>MXtd</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDIR" -->
            <field>
              <name>MDIR</name>
              <description>MDir</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK28" -->
            <field>
              <name>MSK28</name>
              <description>Msk28</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK27" -->
            <field>
              <name>MSK27</name>
              <description>Msk27</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK26" -->
            <field>
              <name>MSK26</name>
              <description>Msk26</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK25" -->
            <field>
              <name>MSK25</name>
              <description>Msk25</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK24" -->
            <field>
              <name>MSK24</name>
              <description>Msk24</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK23" -->
            <field>
              <name>MSK23</name>
              <description>Msk23</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK22" -->
            <field>
              <name>MSK22</name>
              <description>Msk22</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK21" -->
            <field>
              <name>MSK21</name>
              <description>Msk21</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK20" -->
            <field>
              <name>MSK20</name>
              <description>Msk20</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK19" -->
            <field>
              <name>MSK19</name>
              <description>Msk19</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK18" -->
            <field>
              <name>MSK18</name>
              <description>Msk18</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK17" -->
            <field>
              <name>MSK17</name>
              <description>Msk17</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSK16" -->
            <field>
              <name>MSK16</name>
              <description>Msk16</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2ARB1" -->
        <register>
          <name>IF2ARB1</name>
          <description>IF2 Arbitration Registers 1</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ID15" -->
            <field>
              <name>ID15</name>
              <description>ID15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID14" -->
            <field>
              <name>ID14</name>
              <description>ID14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID13" -->
            <field>
              <name>ID13</name>
              <description>ID13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID12" -->
            <field>
              <name>ID12</name>
              <description>ID12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID11" -->
            <field>
              <name>ID11</name>
              <description>ID11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID10" -->
            <field>
              <name>ID10</name>
              <description>ID10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID9" -->
            <field>
              <name>ID9</name>
              <description>ID9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID8" -->
            <field>
              <name>ID8</name>
              <description>ID8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID7" -->
            <field>
              <name>ID7</name>
              <description>ID7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID6" -->
            <field>
              <name>ID6</name>
              <description>ID6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID5" -->
            <field>
              <name>ID5</name>
              <description>ID5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID4" -->
            <field>
              <name>ID4</name>
              <description>ID4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID3" -->
            <field>
              <name>ID3</name>
              <description>ID3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID2" -->
            <field>
              <name>ID2</name>
              <description>ID2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID1" -->
            <field>
              <name>ID1</name>
              <description>ID1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ID0" -->
            <field>
              <name>ID0</name>
              <description>ID0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
